;; -*- no-byte-compile: t; -*-
;;; config/niklascarlsson/packages.el

(package! lsp-mode)
(package! company-lsp)
(package! lsp-ui)
(package! ccls)
(package! org-noter)
(package! esh-autosuggest)
(package! fish-completion)
(package! docker-tramp)
(package! org-super-agenda)
(package! org-brain)
(package! ox-hugo)
(package! org-ref)
(package! writeroom-mode)
(package! helm-org-rifle)
(package! spinner)                      ; required by ccls
