;; -*- no-byte-compile: t; -*-
;;; config/niklascarlsson/packages.el

;; writing
(package! org-noter)
(package! org-jira)
(package! ox-hugo)
(package! writeroom-mode)

;; shell
(package! esh-autosuggest)
(package! fish-completion)

;; debugging
(package! dap-mode)

;; recording
(package! gif-screencast)

;; interaction
(package! docker-tramp)
