;; -*- no-byte-compile: t; -*-
;;; config/niklascarlsson/packages.el

;; (package! writeroom-mode)
(package! lsp-mode)
(package! company-lsp)
(package! lsp-ui)
(package! ccls)
(package! cquery)
(package! org-noter)
(package! esh-autosuggest)
(package! fish-completion)
(package! docker-tramp)
(package! org-super-agenda)
(package! org-brain)
(package! lispy)
(package! lispyville)
